<style scoped></style>

<template>
    <div class="p-4">
        <Head>
            <Title> {{ $t("meta.termsTitle") }} </Title>
            <Meta name="description" :content="$t('meta.termsDesc')" />
        </Head>
        <section class="flex flex-col gap-6 w-full max-w-6xl mx-auto bg-bgAccent rounded-3xl p-6 md:p-14 mt-12">
            <header class="relative w-full mb-4">
                <img class="absolute -top-14 md:-top-20 -start-10 opacity-50 mix-blend-screen" src="~/assets/images/line-wave.svg" alt="" />
                <h1 class="text-5xl font-bold">{{ $t("auth.Terms of Service") }}.</h1>
            </header>
            <div class="flex flex-col items-start gap-4">
                <p class="text-lg/normal">
                    در صورت استفاده از هر یک از سرویس‌های منوریوم شما موظف به رعایت شرایط و قوانین زیر هستید. بنابراین پیشنهاد میشود که موارد زیر را با دقت
                    مطالعه کنید. همچنین توجه داشته باشید که صفحه قوانین به صورت دوره‌ای و بر اساس شرایط تغییر می‌کند، بنابراین پیشنهاد می‌کنیم که هر چند وقت یک
                    بار این صفحه را مطالعه بفرمایید.
                </p>
                <p class="text-base/normal opacity-80">از درج هرگونه محتوا که بر اساس قوانين جاری جمهوری اسلامی ايران، مشمول عنوان جرم می‌شود پرهيز کنید.</p>
                <p class="text-base/normal opacity-80">حداقل سن قانونی برای استفاده از سرویس‌های منوریوم ۱۸ سال است.</p>
                <p class="text-base/normal opacity-80">
                    از درج هرگونه محتوا که بر خلاف عفت عمومی و يا هنجارهای متعارف جامعه باشد، و يا به گونه‌ای اهانت به مقدسات دینی اديان قانونی ياد شده در قانون
                    اساسی بشود، خودداری کنید.
                </p>
                <p class="text-base/normal opacity-80">
                    از درج هر گونه محتوا که به واسطه آن به اشخاص حقيقی يا حقوقی تابع کشور جمهوری اسلامی ايران توهين شود ممانعت کنید.
                </p>
                <p class="text-base/normal opacity-80">
                    مسئولیت حساب کاربری و تمامی فایل‌ها و متونی که در منوی خود استفاده میکنید به عهده سازنده آن حساب کاربری می‌باشد. توجه کنید که رعایت نکردن
                    قوانین موجب بسته شدن صفحه منو و حساب کاربری خواهد شد. درصورت نیاز به اطلاع‌رسانی و هشدار، تیم پشتیبانی منوریوم از طریق پست الکترونیک یا
                    شماره تماس وارد شده با شما ارتباط برقرار خواهد کرد.
                </p>
                <p class="text-base/normal opacity-80">
                    مسئولیت درست نبودن اطلاعات کاربری و اطلاعات پرداخت به عهده کاربر می‌باشد و منوریوم در قبال اتفاقات ناشی از آن مسئولیتی ندارد.
                </p>
                <p class="text-base/normal opacity-80">
                    مسئولیت حقوقی هرگونه محتوایی که در سرویس‌های منوریوم استفاده کنید متوجه کاربر می‌شود و سایت منوریوم هیچگونه مسئولیتی در قبال محتوای منوها
                    نمی‌پذیرد.
                </p>
                <p class="text-base/normal opacity-80">منوریوم حق دارد در صورت نیاز در هر زمان سرویس ارائه شده را تغییر دهد و یا لغو کند.</p>
                <p class="text-base/normal opacity-80">
                    در صورت مغایرت محتوای منوها با قوانین جمهوری اسلامی ایران، منوریوم میتواند محتوای مجرمانه و یا در صورت نیاز رستوران متخلف را حذف کند.
                </p>
                <p class="text-base/normal opacity-80">
                    خرید و فروش منو و برند های ساخته شده در منوریوم بدون هماهنگی، غیرقانونی است و در صورت مشاهده علاوه بر غیرفعال کردن برند، این مورد به صورت
                    قانونی پیگیری خواهد شد.
                </p>
                <p class="text-base/normal opacity-80">
                    در صورت استفاده از نام‌های غیرمتعارف در نام برند یا رستوران، منوریوم بدون اطلاع قبلی و در سریع‌ترین زمان ممکن منو و برند مورد نظر را حذف
                    خواهند نمود.
                </p>
                <p class="text-base/normal opacity-80">
                    منوریوم می‌تواند به دلایل مختلف در هر زمانی اقدام به دریافت مدارک شناسایی صاحب برند و رستوران یا تعهدنامه کتبی نماید.
                </p>
                <p class="text-base/normal opacity-80">
                    در صورت استفاده از محتوای تهدیدآمیز یا سوء استفاده شفاهی و کتبی نسبت به هر یک از منوهای اینترنتی ساخته شده در منوریوم، کارمندان منوریوم و یا
                    خود شرکت، حساب کاربری و برند و منوی شما مسدود می‌شود.
                </p>
                <p class="text-base/normal opacity-80">منوریوم حق دارد در صورت نیاز، محتوا ارائه شده در هر منو را بر اساس تشخیص خود، حذف یا غیرفعال نماید.</p>
                <p>
                    منوریوم در زمان پیش‌آمدن موارد فورس ماژور مانند بلایای طبیعی، جنگ، شورش، اعتصاب، تحریم، قطعی اینترنت و ارتباطات داخلی و بین‌المللی، مسوولیتی
                    در قبال انجام نشدن تعهدات خود ندارد.
                </p>
                <img class="w-auto h-16 mix-blend-difference mt-10" src="~/assets/images/signature.png" alt="" />
            </div>
        </section>
    </div>
</template>

<script setup>
definePageMeta({ layout: "default" });
</script>
